MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/tim/implementation_2/hal_ll_tim.c
    uint8_t tmp_channel;

    // Map new pin
    hal_ll_tim_hw_specifics_map[ module_index ].config.pin = _tim_map[ index ].pin;
    tmp_channel = _tim_map[ index ].channel;
    hal_ll_tim_hw_specifics_map[ module_index ].config.af = _tim_map[ index ].af;

    if ( tmp_channel >= HAL_LL_TIM_CHANNEL_1N ) {
        HAL_LL_TIM_IS_COMPLEMENTARY = true;
        hal_ll_tim_hw_specifics_map[ module_index ].config.channel = tmp_channel - 4;
    } else {
        HAL_LL_TIM_IS_COMPLEMENTARY = false;
        hal_ll_tim_hw_specifics_map[ module_index ].config.channel = tmp_channel;
    }
}

static void _hal_ll_tim_alternate_functions_set_state( hal_ll_tim_hw_specifics_map_t *map, bool hal_ll_state ) {

    uint32_t      tim_config = 0;
    module_struct module;

    if( map->config.pin != HAL_LL_PIN_NC ) {
        if( hal_ll_state == false ) {
            tim_config = GPIO_CFG_MODE_ALT_FUNCTION |
                    GPIO_CFG_SPEED_LOW |
                    GPIO_CFG_OTYPE_PP;
        } else {
            tim_config = GPIO_CFG_MODE_ALT_FUNCTION |
                    GPIO_CFG_SPEED_HIGH |
                    GPIO_CFG_OTYPE_PP;
        }

        module.pins[ 0 ] = VALUE( map->config.pin, map->config.af );
        module.pins[ 1 ] = GPIO_MODULE_STRUCT_END;

        module.configs[ 0 ] = tim_config;
        module.configs[ 1 ] = GPIO_MODULE_STRUCT_END;

        /* STM32F1xx specific */
        module.gpio_remap   = map->config.af;

        hal_ll_gpio_module_struct_init( &module, hal_ll_state );
    }
}

static void _hal_ll_tim_hw_init( hal_ll_tim_hw_specifics_map_t *map ) {

    uint32_t tim_clk = 0;
    uint32_t prescaler = 0;
    uint32_t period = 0;
    uint32_t ticks = 0;

    /**
     * Obtain pointer to TIM register block (TIMx)
     */
    hal_ll_tim_base_handle_t *hal_ll_hw_reg = hal_ll_tim_get_base_struct( map->base );

    /**
     * Configure timer as up-counter (edge-aligned mode)
     * Clear DIR bit → counter counts from 0 up to ARR
     */
    clear_reg_bit( &hal_ll_hw_reg->cr1, HAL_LL_TIM_CR1_DIR_BIT );

    /**
     * Get actual timer input clock (already includes APB x2 rule
     * or other MCU-specific timer clock selection logic)
     */
    tim_clk = _hal_ll_tim_get_clock_speed( map->module_index );

    /**
     * Total number of timer ticks required for one PWM period
     *
     * ticks = TIM_CLK / desired_frequency
     *
     * This represents:
     *   (PSC + 1) x (ARR + 1)
     */
    ticks = tim_clk / map->freq_hz;

    /**
     * Compute prescaler so that ARR fits into 16 bits.
     *
     * prescaler is chosen as:
     *   prescaler = floor( ticks / 65536 )
     *
     * This ensures:
     *   (ARR + 1) <= 65536
     */
    prescaler = ( ticks / ( UINT16_MAX + 1ul ) );

    /**
     * Clamp prescaler to 16-bit hardware limit.
     * If this happens, requested frequency is too low
     * to be represented exactly.
     */
    if ( prescaler > UINT16_MAX ) {
        prescaler = UINT16_MAX;

        /**
         * Update effective frequency to maximum achievable value
         * (used by higher layers to report actual output frequency)
         */
        map->freq_hz = tim_clk;
    }

    /**
     * Compute ARR value based on prescaler:
     *
     *   ARR = (ticks / (PSC + 1)) - 1
     *
     * PWM frequency becomes:
     *   f = TIM_CLK / ((PSC + 1) x (ARR + 1))
     */
    period = ( ticks / ( prescaler + 1 ) ) - 1;

    /* Clamp ARR to 16-bit limit */
    if ( period > UINT16_MAX )
        period = UINT16_MAX;

    // Write prescaler register (PSC)
    hal_ll_hw_reg->psc = (uint16_t)prescaler;

    // Write auto-reload register (ARR)
    hal_ll_hw_reg->arr = (uint16_t)period;

    /**
     * Store maximum period value for duty-cycle scaling
     * (used as CCRx upper limit)
     */
    map->max_period = (uint16_t)period;
}

static void _hal_ll_tim_init( hal_ll_tim_hw_specifics_map_t *map ) {

    _hal_ll_tim_set_clock( map->module_index, true );

    _hal_ll_tim_alternate_functions_set_state( map, true );

    _hal_ll_tim_hw_init( map );
}
// ------------------------------------------------------------------------- END
